<template>
    <i-article>
        <article>
            <h1>组件库简介</h1>
            <Anchor title="设计背景" h2></Anchor>
            <p>目前公司承接项目包括较多大屏内容，针对这方面的内容，公司领导提出优化大屏开发效率，降低开发成本，经过UE、UI、前端三个部门的同事讨论沟通过，决定将大屏常见组件（包括但不限于）进行沉淀，以便后续项目复用、参考。</p>
            <Anchor title="设计目标" h2></Anchor>
            <p>针对层出不穷的大屏项目，有以下几点目标：</p>
            <p>1、形成一套完整的开发体系规范</p>
            <p>2、提供较为常用的组件及布局方案</p>
            <p>3、提供相关案例</p>
            
            <Anchor title="组件库特点" h2></Anchor>
            <ul>
                <li>组件便于用户提取复用</li>
                <li>组件代码片段展示友好</li>
                <li>组件库方便维护</li>
            </ul>

            <Anchor title="组件库内容" h2></Anchor>
            <p>大屏组件库的目的是提高大屏开发效率，总体规划包括但不限于以下部分</p>
            <ul>
                <li>常用的特殊配置的echats图表</li>
                <li>常用js代码片段</li>
                <li>css3动画、特效</li>
                <li>常用三方库</li>
                <li>特殊需求的解决方案</li>
            </ul>

            <Anchor title="工作成果" h2></Anchor>
            <p>从2017年年底初步定下方案并不断探索实践后，前端研发部对于大数据业务的工作成果如下：</p>
            <ul>
                <li>前端开发规范的复用改进</li>
                <p>相比于其他常规的业务系统类业务，大数据业务的重心在于数据的可视化展示，更注重展示的效果，单页面之间的内容联动等，而页面之间的逻辑联系就没有那么复杂了，经过探索实践之后，我们基于<a href="http://fe.epoint.com.cn:8080/fedemo/pages/codeguide/" target="_blank">前端代码规范</a>、<a href="http://192.168.201.159/fedoc/?file=002-%E5%9B%A2%E9%98%9F%E8%A7%84%E8%8C%83/001-%E6%8A%80%E6%9C%AF%E8%A7%84%E8%8C%83/005-%E5%89%8D%E5%90%8E%E7%AB%AF%E6%95%B0%E6%8D%AE%E4%BA%A4%E4%BA%92%E8%A7%84%E8%8C%83" target="_blank">前后端数据交互规范</a>整理了一套<a href="#/docs/guide/develop-rules" class="">大屏开发规范</a>，该规范针对大数据业务进行定制，目前前端研发部在相关业务中执行此规范并不断完善。</p>
                <li>颗粒化的组件复用</li>
                <p>目前大数据项目个性化程度普遍较高，页面中模块与模块存在较强的逻辑关系，这就导致了单个模块的沉淀复用性较差，考虑到这一点，我们把最初的“组件复用”细化到“迷你组件复用”，简单来说，我们抽离了组件中复杂的逻辑关系，复用单位最小化到一个元素，比如一个echarts特殊图表、一个多级联动的下拉框、一个带有特殊效果的按钮等。这样一来就能大大提高组件复用的效率。</p>
                <li>高级动画效果</li>
                <p>各种复杂的动画效果目前基本上是每个大数据项目的标配了，针对这个情况，我们将会多次出现的动画效果沉淀在大屏组件库中，且在日常的工作中不断去新增内容。主要包括元素的动态展示，动态交互等效果。</p>
                <li>特殊需求的实现思路</li>
                <p>对于一些特殊的需求，考虑到需求的个性化程度、应用场景，完整的需求沉淀显得有点“没必要”，这类需求往往是一次性的，完整沉淀有点浪费，不沉淀又有点可惜。最后，我们采用“授人以鱼不如授人以渔”的方式进行沉淀，取其“渔”而去其“鱼”，将需求的实现思路沉淀下来，并定期组织培训，这样，后续做到类似的需求，都可以从容应对。</p>
                <li>开发中用到的工具、三方库、自定义插件等内容沉淀</li>
                <p>对于一些在大数据项目中常用的其他资源，我们会沉淀并分享出来，并提供对应的资源下载，使用方法，供每一位开发人员无压力使用。</p>
                <li>地图相关</li>
                <p>地图在大数据项目中占得比重很大，基本每个项目多多少少都会有地图。地图方面经常会遇到这些问题：</p>
                <p>1. 对于一些小的区县的地图数据，往往需要花费大量人力去绘制。</p>
                <p>2. 部分地区存在地图合并、新增区域等特殊需求。</p>
                <p>3. 个性化地图定制。</p>
                <p>针对这些情况，我们整理了相关<a href="#/components/map" class="">地图工具</a>，并部署在公司服务器上供所有同事使用，在公司论坛和博客中，我们也分享了这些工具的使用教程，极大地提高了和项目组的对接效率以及开发效率。</p>
                <li>经验分享</li>
                <p>日常开发工作中踩过的坑、遇到过的问题，我们会收集整理起来，并结合实际项目在例会上分享，为每一位同事提供更好的解决方案。</p>
            </ul>

            <Anchor title="后续规划" h2></Anchor>
            <ul>
                <li>在已有成果的基础上不断改进完善。</li> 
                <li>高级特效的探索沉淀。</li> 
                <li>其他能够提升开发效率、质量的的方案探索实施。</li>
            </ul>

            <Alert show-icon>组件库基于iView在线文档搭建</Alert>
        </article>
    </i-article>
</template>
<script>
import iArticle from "../../components/article.vue";
import Anchor from "../../components/anchor.vue";

export default {
  components: {
    iArticle,
    Anchor
  },
  data() {
    return {};
  },
  methods: {}
};
</script>